DesignPattern/c-factory.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-12-11 Tue 02:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>工厂模式</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">工厂模式</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgedef072">1. 最原始的方式</a></li>
<li><a href="#org3d6b7c4">2. 有了接口之后</a></li>
<li><a href="#orgacc7e65">3. 简单工厂</a></li>
<li><a href="#orga60af77">4. 工厂方法模式</a></li>
</ul>
</div>
</nav>
<p>
代码编写出来是为了给别人 (client) 调用的:
</p>
<ul class="org-ul">
<li>调用者 (client) 跟代码编写者 (provider)，可能是同一个人，也可能是不同的人</li>
<li>提供给调用者的代码，有可能是源码可见的，也可能是源码不可见、不可修改的(比如 jar 包)</li>
</ul>

<p>
所以，为了简化代码的协作使用及管理维护，必须想尽办法简化代码逻辑，实现必要的<b>分离</b>。
</p>


<section id="outline-container-orgedef072" class="outline-2">
<h2 id="orgedef072"><span class="section-number-2">1</span> 最原始的方式</h2>
<div class="outline-text-2" id="text-1">
<p>
比如说，有一系列的代码，是用来创建不同品牌的手机。代码是这样的:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Iphone</span> {
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">xxx</span> () {}
}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Huawei</span> {
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">yyy</span> () {}
}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Lennovo</span> {}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Xiaomi</span> {}
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Vivo</span> {}
</pre>
</div>

<p>
如果这样的代码提供给客户端调用，那么提供者必须要将<b>所有类的名称</b>以及<b>对应的方法</b>暴露给客户端。
</p>

<p>
客户端的调用示例如下:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Iphone</span> <span class="org-variable-name">phone1</span> = <span class="org-keyword">new</span> <span class="org-type">Iphone</span>();
phone1.xxx();

<span class="org-type">Huawei</span> <span class="org-variable-name">phone2</span> = <span class="org-keyword">new</span> <span class="org-type">Huawei</span>();
phone2.yyy();
</pre>
</div>

<p>
这样的方式非常原始，也很简单，但是代码的逻辑不清晰，暴露的内容过多。
</p>

<p>
解决的方案:
</p>
<ul class="org-ul">
<li>抽象逻辑，提供<b>接口</b></li>
</ul>
</div>
</section>

<section id="outline-container-org3d6b7c4" class="outline-2">
<h2 id="org3d6b7c4"><span class="section-number-2">2</span> 有了接口之后</h2>
<div class="outline-text-2" id="text-2">
<p>
为了减少方法调用的复杂度，也为了便于抽象跟代码管理，咱们额外提供一个接口:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">interface</span> <span class="org-type">Phone</span> {
    <span class="org-type">void</span> <span class="org-function-name">play</span>();
}
</pre>
</div>

<p>
然后，将所有手机类都实现 Phone 接口，将暴露给客户端调用的逻辑都封装在 play 方法里。
</p>

<p>
那么，客户端需要知道的调用 API 就减少到了两种:
</p>
<ol class="org-ol">
<li>Phone 接口的信息</li>
<li>Phone 接口有哪些实现类</li>
</ol>

<p>
调用的逻辑就变简单了:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Phone</span> <span class="org-variable-name">phone1</span> = <span class="org-keyword">new</span> <span class="org-type">Iphone</span>();
phone1.play();

<span class="org-type">Phone</span> <span class="org-variable-name">phone2</span> = <span class="org-keyword">new</span> <span class="org-type">Lianxiang</span>();
phone2.play();

<span class="org-type">Phone</span> <span class="org-variable-name">phone3</span> = <span class="org-keyword">new</span> <span class="org-type">Xiaomii</span>();
phone3.play();
</pre>
</div>

<p>
这种方式有缺点:
</p>
<ol class="org-ol">
<li>客户端，必须要知道手机类的具体名字</li>
<li>客户端的调用，跟提供的代码是耦合的</li>
</ol>

<p>
所以，自然产生了简单工厂的这种策略
</p>
</div>
</section>

<section id="outline-container-orgacc7e65" class="outline-2">
<h2 id="orgacc7e65"><span class="section-number-2">3</span> 简单工厂</h2>
<div class="outline-text-2" id="text-3">
<p>
在中间加一层:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">PhoneFactory</span> {
    <span class="org-keyword">public</span> <span class="org-type">Phone</span> <span class="org-function-name">createPhone</span>(<span class="org-type">String</span> <span class="org-variable-name">tag</span>) {
        <span class="org-keyword">if</span> (tag.equals(<span class="org-string">"lx"</span>)) {
            <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Lenovo</span>();
        } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (tag.equals(<span class="org-string">"pg"</span>)) {
            <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Iphone</span>();
        } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (tag.equals(<span class="org-string">"hw"</span>)) {
            <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Huawei</span>();
        }
    }
}
</pre>
</div>

<p>
客户端的调用:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">PhoneFactory</span> <span class="org-variable-name">pf</span> = <span class="org-keyword">new</span> <span class="org-type">PhoneFactory</span>();

pf.createPhone(<span class="org-string">"hw"</span>).play();
pf.createPhone(<span class="org-string">"pg"</span>).play();
pf.createPhone(<span class="org-string">"xm"</span>).play();
</pre>
</div>

<p>
简单工厂模式，本身已经为解耦合做出了很好的方案。但是它有缺点:
</p>
<ul class="org-ul">
<li>PhoneFactory 代码跟 Phone 代码紧耦合</li>
<li>每次要添加/删除/修改某一个 Phone，<b>都</b>需要修改 PhoneFactory 这个类</li>
</ul>

<p>
解决方案就是<b>工厂方法模式</b>
</p>
</div>
</section>

<section id="outline-container-orga60af77" class="outline-2">
<h2 id="orga60af77"><span class="section-number-2">4</span> 工厂方法模式</h2>
<div class="outline-text-2" id="text-4">
<p>
为 Phone 工厂，创建一个接口:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">interface</span> <span class="org-type">PhoneFactory</span> {
    <span class="org-type">Phone</span> <span class="org-function-name">createPhone</span>();
}
</pre>
</div>

<p>
如果增加了一款产品，比如是 iPhone，那么，只需要为 iPhone 创建一个工厂类就可以了:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">IphoneFactory</span> <span class="org-keyword">implements</span> <span class="org-type">PhoneFactory</span> {
    <span class="org-keyword">public</span> <span class="org-type">phone</span> <span class="org-function-name">createPhone</span>() {
        <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">IphoneX</span>();
    }
}
</pre>
</div>

<p>
如果再增加另外一款产品，比如 Huawei，那么只需要另外一个工厂就可以了:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">HuaweiFactory</span> <span class="org-keyword">implements</span> <span class="org-type">PhoneFactory</span> {
    <span class="org-keyword">public</span> <span class="org-type">phone</span> <span class="org-function-name">createPhone</span>() {
        <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Huawei</span>();
    }
}
</pre>
</div>

<p>
客户端的调用:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">PhoneFactory</span> <span class="org-variable-name">hwPf</span> = <span class="org-keyword">new</span> <span class="org-type">HuaweiFactory</span>();
hwPf.play();

<span class="org-type">PhoneFactory</span> <span class="org-variable-name">pgPf</span> = <span class="org-keyword">new</span> <span class="org-type">IphoneFactory</span>();
pgPf.play();
</pre>
</div>

<p>
工厂方法模式，是最标准的一种工厂模式，也是应用广泛的一种模式。
</p>

<p>
但是工厂方法模式，有一个很大的缺点:
</p>
<ul class="org-ul">
<li></li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-12-11 Tue 02:47</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
